src/Documents/Доходы/Доходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Доходы</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДоходов</name>
    <type>
      <types>CatalogRef.КатегорииДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/Доходы/Доходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Доходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорииДоходов</name>
    <type>
      <types>CatalogRef.КатегорииДоходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Баланс/Баланс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Баланс</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счета</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Доходы/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль объекта документа Доходы.
// Валидация реквизитов при записи и формирование движений по регистрам Доходы и Баланс.
// Сумма в регистрах — в валюте учёта; ВалютнаяСумма — в валюте операции.
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПроверитьРеквизитыДокумента(Отказ);
	
	Если Не Отказ Тогда
		
		ПроверитьКурсВалютыОперации(Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Сумма проверяется отдельно: fillChecking считает 0 незаполненным,
	// но для отрицательных значений нужна явная проверка «больше нуля».
	ИндексСуммы = ПроверяемыеРеквизиты.Найти("Сумма");
	
	Если ИндексСуммы <> Неопределено Тогда
		
		ПроверяемыеРеквизиты.Удалить(ИндексСуммы);
		
	КонецЕсли;
	
	Если Сумма <= 0 Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Сумма дохода должна быть больше нуля.", "Сумма");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	СуммаУчета = ОбщийМодульСервер_КурсыВалют.СуммаВВалютеУчета(Сумма, Валюта, Дата);
	
	// регистр Доходы
	Движения.Доходы.Записывать = Истина;
	Движение = Движения.Доходы.Добавить();
	Движение.Период = Дата;
	Движение.Валюта = Валюта;
	Движение.КатегорииДоходов = КатегорияДоходов;
	Движение.Сумма = СуммаУчета;
	Движение.ВалютнаяСумма = Сумма;
	
	// регистр Баланс — приход увеличивает остаток по счёту
	Движения.Баланс.Записывать = Истина;
	Движение = Движения.Баланс.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Валюта = Валюта;
	Движение.Счета = Счет;
	Движение.Сумма = СуммаУчета;
	Движение.ВалютнаяСумма = Сумма;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет обязательные реквизиты документа независимо от способа создания
// (стандартная форма, быстрый ввод, программная запись).
//
Процедура ПроверитьРеквизитыДокумента(Отказ)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Не заполнена дата.", "Дата");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Счет) Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Не заполнен счет.", "Счет");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Не заполнена валюта.", "Валюта");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КатегорияДоходов) Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Не заполнена категория доходов.", "КатегорияДоходов");
		
	КонецЕсли;
	
	Если Сумма <= 0 Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Сумма дохода должна быть больше нуля.", "Сумма");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьКурсВалютыОперации(Отказ)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Если Валюта = ВалютаУчета Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ОбщийМодульСервер_КурсыВалют.ПолучитьДанныеКурса(Валюта, Дата) = Неопределено Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения(ОбщийМодульСервер_КурсыВалют.ТекстСообщенияОбОтсутствииКурса(Валюта, Дата), "Валюта");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СообщитьОшибкуЗаполнения(ТекстСообщения, ИмяПоля)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Поле = ИмяПоля;
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти
